Repository: getio0909/linguamesh-l10n
Catalog: generated/windows/*/Resources.resw
Source language: en
Languages: ar, es, fr, hi, ja, pt_br, ru, zh_hant

# nav.text_translation
source: Text translation
ar: ترجمة النص
es: Traducción de texto
fr: Traduction de texte
hi: पाठ अनुवाद
ja: テキスト翻訳
pt_br: Tradução de texto
ru: Перевод текста
zh_hant: 文字翻譯

# action.translate
source: Translate
ar: ترجمة
es: Traducir
fr: Traduire
hi: अनुवाद करें
ja: 翻訳
pt_br: Traduzir
ru: Перевести
zh_hant: 翻譯

# action.cancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hant: 取消

# provider.active
source: Active provider: {0}
ar: المزوّد النشط: {0}
es: Proveedor activo: {0}
fr: Fournisseur actif : {0}
hi: सक्रिय प्रदाता: {0}
ja: 使用中のプロバイダー：{0}
pt_br: Provedor ativo: {0}
ru: Активный провайдер: {0}
zh_hant: 目前提供者：{0}

# translation.progress
source: {0} of {1} segments translated
ar: تمت ترجمة {0} من {1} مقاطع
es: {0} de {1} segmentos traducidos
fr: {0} segments traduits sur {1}
hi: {1} में से {0} खंडों का अनुवाद हुआ
ja: {1} 件中 {0} 件のセグメントを翻訳済み
pt_br: {0} de {1} segmentos traduzidos
ru: Переведено сегментов: {0} из {1}
zh_hant: 已翻譯 {0}/{1} 個片段

# document.file_count.one
source: {0} file
ar: تم تحديد ملف واحد ({0})
es: {0} archivo
fr: {0} fichier
hi: {0} फ़ाइल
pt_br: {0} arquivo
ru: {0} файл

# document.file_count.other
source: {0} files
ar: تم تحديد {0} ملف
es: {0} archivos
fr: {0} fichiers
hi: {0} फ़ाइलें
ja: {0} 個のファイル
pt_br: {0} arquivos
ru: {0} файла
zh_hant: 已選取 {0} 個檔案

# history.mode.disabled
source: History is disabled
ar: السجل معطّل
es: El historial está desactivado
fr: L’historique est désactivé
hi: इतिहास बंद है
ja: 履歴は無効です
pt_br: O histórico está desativado
ru: История отключена
zh_hant: 歷史記錄已停用

# history.mode.enabled
source: History is saved on this device
ar: يُحفظ السجل على هذا الجهاز
es: El historial se guarda en este dispositivo
fr: L’historique est enregistré sur cet appareil
hi: इतिहास इस डिवाइस पर सहेजा जाता है
ja: 履歴はこのデバイスに保存されます
pt_br: O histórico é salvo neste dispositivo
ru: История сохраняется на этом устройстве
zh_hant: 歷史記錄儲存在此裝置上

# history.mode.incognito
source: Incognito mode does not save this translation
ar: لا يحفظ وضع التصفح الخفي هذه الترجمة
es: El modo incógnito no guarda esta traducción
fr: Le mode navigation privée n’enregistre pas cette traduction
hi: गुप्त मोड इस अनुवाद को नहीं सहेजता
ja: シークレットモードではこの翻訳は保存されません
pt_br: O modo anônimo não salva esta tradução
ru: В режиме инкогнито этот перевод не сохраняется
zh_hant: 無痕模式不會儲存此翻譯

# error.authentication_failed
source: Check the credentials for {0} and try again.
ar: تحقق من بيانات اعتماد {0} وحاول مرة أخرى.
es: Comprueba las credenciales de {0} e inténtalo de nuevo.
fr: Vérifiez les identifiants de {0}, puis réessayez.
hi: {0} के क्रेडेंशियल जाँचें और फिर से कोशिश करें।
ja: {0} の認証情報を確認して、もう一度お試しください。
pt_br: Verifique as credenciais de {0} e tente novamente.
ru: Проверьте учетные данные для {0} и повторите попытку.
zh_hant: 請檢查 {0} 的憑證，然後再試一次。

# error.rate_limited.one
source: Try again in {0} second.
ar: أعد المحاولة بعد ثانية واحدة ({0}).
es: Inténtalo de nuevo en {0} segundo.
fr: Réessayez dans {0} seconde.
hi: {0} सेकंड बाद फिर से कोशिश करें।
pt_br: Tente novamente em {0} segundo.
ru: Повторите попытку через {0} секунду.

# error.rate_limited.other
source: Try again in {0} seconds.
ar: أعد المحاولة بعد {0} ثانية.
es: Inténtalo de nuevo en {0} segundos.
fr: Réessayez dans {0} secondes.
hi: {0} सेकंड बाद फिर से कोशिश करें।
ja: {0} 秒後にもう一度お試しください。
pt_br: Tente novamente em {0} segundos.
ru: Повторите попытку через {0} секунды.
zh_hant: 請在 {0} 秒後再試一次。

# accessibility.stop_translation
source: Stop translation
ar: إيقاف الترجمة
es: Detener traducción
fr: Arrêter la traduction
hi: अनुवाद रोकें
ja: 翻訳を停止
pt_br: Parar tradução
ru: Остановить перевод
zh_hant: 停止翻譯

# locale.current
source: Interface language: {0}
ar: لغة الواجهة: {0}
es: Idioma de la interfaz: {0}
fr: Langue de l’interface : {0}
hi: इंटरफ़ेस भाषा: {0}
ja: インターフェイスの言語：{0}
pt_br: Idioma da interface: {0}
ru: Язык интерфейса: {0}
zh_hant: 介面語言：{0}

# error.network_unavailable
source: Check your network connection and try again.
ar: تحقق من اتصال الشبكة وحاول مرة أخرى.
es: Comprueba la conexión de red e inténtalo de nuevo.
fr: Vérifiez votre connexion réseau, puis réessayez.
hi: अपना नेटवर्क कनेक्शन जाँचें और फिर से कोशिश करें।
ja: ネットワーク接続を確認して、もう一度お試しください。
pt_br: Verifique sua conexão de rede e tente novamente.
ru: Проверьте подключение к сети и повторите попытку.
zh_hant: 請檢查網路連線，然後再試一次。

# onboarding.title
source: Connect a translation provider
ar: الاتصال بمزوّد ترجمة
es: Conectar un proveedor de traducción
fr: Connecter un fournisseur de traduction
hi: अनुवाद प्रदाता से कनेक्ट करें

# onboarding.description
source: Your content goes directly to the provider you configure. LinguaMesh never bundles an API key.
ar: يُرسل محتواك مباشرةً إلى المزوّد الذي تضبطه. لا يتضمن LinguaMesh أي مفتاح API.
es: Tu contenido se envía directamente al proveedor que configures. LinguaMesh nunca incluye una clave de API.
fr: Votre contenu est envoyé directement au fournisseur que vous configurez. LinguaMesh n’intègre jamais de clé API.
hi: आपकी सामग्री सीधे आपके कॉन्फ़िगर किए गए प्रदाता के पास जाती है। LinguaMesh में कोई API कुंजी शामिल नहीं होती।

source: Provider name
ar: اسم المزوّد
es: Nombre del proveedor
fr: Nom du fournisseur
hi: प्रदाता का नाम
ja: プロバイダー名
pt_br: Nome do provedor
ru: Название поставщика
zh_hant: 供應商名稱

# field.endpoint
source: Endpoint
ar: نقطة النهاية
es: Punto de conexión
fr: Point de terminaison
hi: एंडपॉइंट
ja: エンドポイント
ru: Конечная точка
zh_hant: 端點

# field.model
source: Model
ar: النموذج
es: Modelo
fr: Modèle
hi: मॉडल
ja: モデル
pt_br: Modelo
ru: Модель
zh_hant: 模型

# field.api_key
source: API key (optional for local providers)
ar: مفتاح API (اختياري للمزوّدين المحليين)
es: Clave de API (opcional para proveedores locales)
fr: Clé API (facultative pour les fournisseurs locaux)
hi: API कुंजी (स्थानीय प्रदाताओं के लिए वैकल्पिक)
ja: API キー（ローカルプロバイダーでは省略可）
pt_br: Chave de API (opcional para provedores locais)
ru: Ключ API (необязательно для локальных поставщиков)
zh_hant: API 金鑰（本機供應商可選）

# action.save_provider
source: Save provider
ar: حفظ المزوّد
es: Guardar proveedor
fr: Enregistrer le fournisseur
hi: प्रदाता सहेजें
ja: プロバイダーを保存
pt_br: Salvar provedor
ru: Сохранить поставщика
zh_hant: 儲存供應商

# field.source_text
source: Source text
ar: النص المصدر
es: Texto de origen
fr: Texte source
hi: स्रोत टेक्स्ट
ja: 原文
pt_br: Texto de origem
ru: Исходный текст
zh_hant: 來源文字

# field.translation
source: Translation
ar: الترجمة
es: Traducción
fr: Traduction
hi: अनुवाद
ja: 翻訳
pt_br: Tradução
ru: Перевод
zh_hant: 譯文

# settings.title
source: Settings
ar: الإعدادات
es: Configuración
fr: Paramètres
hi: सेटिंग
ja: 設定
pt_br: Configurações
ru: Настройки
zh_hant: 設定

# settings.theme
source: Theme
ar: السمة
es: Tema
fr: Thème
hi: थीम
ja: テーマ
pt_br: Tema
ru: Тема
zh_hant: 主題

# theme.system
source: System
ar: النظام
es: Sistema
fr: Système
hi: सिस्टम
ja: システム
pt_br: Sistema
ru: Системная
zh_hant: 跟隨系統

# theme.light
source: Light
ar: فاتح
es: Claro
fr: Clair
hi: हल्की
ja: ライト
pt_br: Claro
ru: Светлая
zh_hant: 淺色

# theme.dark
source: Dark
ar: داكن
es: Oscuro
fr: Sombre
hi: गहरी
ja: ダーク
pt_br: Escuro
ru: Тёмная
zh_hant: 深色

# settings.ui_language
source: Interface language
ar: لغة الواجهة
es: Idioma de la interfaz
fr: Langue de l’interface
hi: इंटरफ़ेस की भाषा
ja: インターフェースの言語
pt_br: Idioma da interface
ru: Язык интерфейса
zh_hant: 介面語言

# settings.target_language
source: Target language
ar: اللغة الهدف
es: Idioma de destino
fr: Langue cible
hi: लक्ष्य भाषा
ja: 翻訳先の言語
pt_br: Idioma de destino
ru: Целевой язык
zh_hant: 目標語言

# status.ready
source: Ready
ar: جاهز
es: Listo
fr: Prêt
hi: तैयार
ja: 準備完了
pt_br: Pronto
ru: Готово
zh_hant: 就緒

# status.translating
source: Translating…
ar: جارٍ الترجمة…
es: Traduciendo…
fr: Traduction en cours…
hi: अनुवाद हो रहा है…
ja: 翻訳中…
pt_br: Traduzindo…
ru: Выполняется перевод…
zh_hant: 正在翻譯…

# status.cancelled
source: Translation cancelled. Partial output was kept.
ar: أُلغيت الترجمة. تم الاحتفاظ بالمخرجات الجزئية.
es: Traducción cancelada. Se conservó la salida parcial.
fr: Traduction annulée. La sortie partielle a été conservée.
hi: अनुवाद रद्द किया गया। आंशिक आउटपुट रखा गया।
ja: 翻訳をキャンセルしました。途中までの出力は保持されています。
pt_br: Tradução cancelada. A saída parcial foi mantida.
ru: Перевод отменён. Частичный результат сохранён.
zh_hant: 翻譯已取消。已保留部分輸出。

# error.invalid_profile
source: Enter a provider name, endpoint, and model.
ar: أدخل اسم المزوّد ونقطة النهاية والنموذج.
es: Introduce un nombre de proveedor, un punto de conexión y un modelo.
fr: Saisissez un nom de fournisseur, un point de terminaison et un modèle.
hi: प्रदाता का नाम, एंडपॉइंट और मॉडल दर्ज करें।
ja: プロバイダー名、エンドポイント、モデルを入力してください。
pt_br: Informe o nome do provedor, o endpoint e o modelo.
ru: Укажите название поставщика, конечную точку и модель.
zh_hant: 請輸入供應商名稱、端點和模型。

# error.authentication
source: Check the provider credential and try again.
ar: تحقق من بيانات اعتماد المزوّد وحاول مرة أخرى.
es: Comprueba la credencial del proveedor e inténtalo de nuevo.
fr: Vérifiez l’identifiant du fournisseur et réessayez.
hi: प्रदाता क्रेडेंशियल जाँचें और फिर से प्रयास करें।
ja: プロバイダーの認証情報を確認して、もう一度お試しください。
pt_br: Verifique a credencial do provedor e tente novamente.
ru: Проверьте учётные данные поставщика и повторите попытку.
zh_hant: 請檢查供應商憑證，然後再試一次。

# error.incompatible_core
source: This app requires a compatible LinguaMesh Core library.
ar: يتطلب هذا التطبيق مكتبة LinguaMesh Core متوافقة.
es: Esta aplicación requiere una biblioteca LinguaMesh Core compatible.
fr: Cette application nécessite une bibliothèque LinguaMesh Core compatible.
hi: इस ऐप के लिए संगत LinguaMesh Core लाइब्रेरी आवश्यक है।
ja: このアプリには互換性のある LinguaMesh Core ライブラリが必要です。
pt_br: Este aplicativo requer uma biblioteca LinguaMesh Core compatível.
ru: Для этого приложения требуется совместимая библиотека LinguaMesh Core.
zh_hant: 此應用程式需要相容的 LinguaMesh Core 程式庫。

# error.unknown
source: Translation failed. Review diagnostics and try again.
ar: فشلت الترجمة. راجع معلومات التشخيص وحاول مرة أخرى.
es: La traducción falló. Revisa los diagnósticos e inténtalo de nuevo.
fr: La traduction a échoué. Consultez les diagnostics et réessayez.
hi: अनुवाद विफल रहा। निदान की समीक्षा करें और फिर से प्रयास करें।
ja: 翻訳に失敗しました。診断情報を確認して、もう一度お試しください。
pt_br: A tradução falhou. Revise os diagnósticos e tente novamente.
ru: Не удалось выполнить перевод. Просмотрите диагностику и повторите попытку.
zh_hant: 翻譯失敗。請檢視診斷資訊後再試一次。

# diagnostics.title
source: Diagnostics
ar: التشخيص
es: Diagnósticos
hi: निदान
ja: 診断
pt_br: Diagnósticos
ru: Диагностика
zh_hant: 診斷

# diagnostics.summary
source: Core ABI {0} · Protocol {1}
ar: Core ABI {0} · البروتوكول {1}
es: ABI de Core {0} · Protocolo {1}
fr: ABI du Core {0} · Protocole {1}
hi: Core ABI {0} · प्रोटोकॉल {1}
ja: Core ABI {0} · プロトコル {1}
pt_br: ABI do Core {0} · Protocolo {1}
ru: ABI ядра {0} · Протокол {1}
zh_hant: Core ABI {0} · 通訊協定 {1}

# action.close_settings
source: Close settings
ar: إغلاق الإعدادات
es: Cerrar configuración
fr: Fermer les paramètres
hi: सेटिंग बंद करें
ja: 設定を閉じる
pt_br: Fechar configurações
ru: Закрыть настройки
zh_hant: 關閉設定

# accessibility.source_content
source: Text to translate
ar: النص المطلوب ترجمته
es: Texto que se va a traducir
fr: Texte à traduire
hi: अनुवाद किया जाने वाला टेक्स्ट
ja: 翻訳するテキスト
pt_br: Texto a traduzir
ru: Текст для перевода
zh_hant: 待翻譯文字

# accessibility.translation_output
source: Streamed translation output
ar: مخرجات الترجمة المتدفقة
es: Salida de traducción en streaming
fr: Sortie de traduction en continu
hi: स्ट्रीम किया गया अनुवाद आउटपुट
ja: ストリーミング翻訳の出力
pt_br: Saída de tradução em fluxo
ru: Потоковый результат перевода
zh_hant: 串流翻譯輸出
